/**
 * 1. Реализовать вычисление выражения для операций (без учета приоритетов): умножение,
 * сложение, вычитание, деление
 * 2. Реализовать поддержку работу чисел с плавающей запятой
 * 3. Реализовать вычисление квадратного корня
 * 4. * Попробовать применить ScriptEngine для вычисления сложный математических выражений
 * 5. *** Реализовать вычисление выражения для операций (с учетом приоритетов и без ScriptEngine):
 * умножение, сложение, вычитание, деление
 */

public class CalculatorApp {
    public static void main(String[] args) {
        new CalculatorFrame();
    }
}

